.tmp_pytest/test_compile_ingest_analyze_pi0/pipe_case/constant/physicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
viscosityModel  constant;
nu              [0 2 -1 0 0 0 0] 1e-06;
