.tmp_pytest/test_compile_ingest_analyze_pi0/pipe_case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.02 0 0);
boundaryField
{
    inlet
    {
        type fixedValue;
        value nonuniform List<vector>
        10
        (
        (0.0398 0 0)
        (0.039 0 0)
        (0.0374 0 0)
        (0.035 0 0)
        (0.0318 0 0)
        (0.0278 0 0)
        (0.023 0 0)
        (0.0174 0 0)
        (0.011 0 0)
        (0.0038 0 0)
        );
    }
    outlet
    {
        type                pressureInletOutletVelocity;
        value               $internalField;
    }
    walls
    {
        type                noSlip;
    }
    side1 { type wedge; }
    side2 { type wedge; }
}
