.tmp_pytest/test_compile_ingest_analyze_pi0/pipe_case/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver GAMG;
        smoother GaussSeidel;
        tolerance 0.0001;
        relTol 0.01;
    }
    U
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 0.0001;
        relTol 0;
    }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p               0.0001;
        U               0.0001;
    }
}
relaxationFactors
{
    fields { p 0.3; }
    equations { U 0.7; }
}
